Тест/Тест/src/InformationRegisters/ДолжностиСотрудников/ДолжностиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДолжностиСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>ТипДоговора</name>
    <type>
      <types>CatalogRef.ТипыКадровыхДоговоров</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОформления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОкладБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/InformationRegisters/ИндНомер/ИндНомер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИндНомер</name>
  <resources>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>наценка</name>
    <type>
      <types>CatalogRef.Коофициенты</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>цп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>дн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>п</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>АвитоЧастник</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоНовыйИндКод</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Стеллаж</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПроверена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.МоделиАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияКонвеера</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьФото</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.Состояние</types>
    </type>
  </attributes>
  <attributes>
    <name>Поддон</name>
    <type>
      <types>CatalogRef.Поддоны</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДляПоиска</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подкатегория</name>
    <type>
      <types>CatalogRef.Категории</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеСлова</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНаличия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактНаличия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаНаличие</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетальКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверкиЕстьВНаличии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЕстьВНаличии</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАвтозагрузкеАвито</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/Documents/КадровыйПриказ/КадровыйПриказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КадровыйПриказ</name>
  <registerRecords>InformationRegister.дт_НачисленияФиксированныеПлан</registerRecords>
  <registerRecords>InformationRegister.ДолжностиСотрудников</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсходящий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоговора</name>
    <type>
      <types>CatalogRef.ТипыКадровыхДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Город</types>
    </type>
  </attributes>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Мотивация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОформления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДоговора</name>
      <type>
        <types>CatalogRef.ТипыКадровыхДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкладБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Надбавки</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>CatalogRef.дт_ВидыРасчетовЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/HTTPServices/wt10_Authorization/Module.bsl
#Область ОбработчикиСобытий

Функция ПолучитьАвторизациюСотрудникаAuthorizationemployee(Запрос)
	
	ЗапросСотрудника = Новый запрос;
	ЗапросСотрудника.Текст = "ВЫБРАТЬ
							 |	ДолжностиСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
							 |	ДолжностиСотрудниковСрезПоследних.Организация КАК Организация,
							 |	ДолжностиСотрудниковСрезПоследних.Подразделение КАК Подразделение,
							 |	ДолжностиСотрудниковСрезПоследних.Должность КАК Должность,
							 |	ДолжностиСотрудниковСрезПоследних.ТипДоговора КАК ТипДоговора,
							 |	ДолжностиСотрудниковСрезПоследних.Период КАК Период
							 |ПОМЕСТИТЬ втДолжности
							 |ИЗ
							 |	РегистрСведений.ДолжностиСотрудников.СрезПоследних КАК ДолжностиСотрудниковСрезПоследних
							 |
							 |ИНДЕКСИРОВАТЬ ПО
							 |	Сотрудник,
							 |	Организация,
							 |	Подразделение,
							 |	Должность,
							 |	ТипДоговора,
							 |	Период
							 |;
							 |
							 |////////////////////////////////////////////////////////////////////////////////
							 |ВЫБРАТЬ
							 |	втДолжности.Сотрудник КАК Сотрудник,
							 |	МАКСИМУМ(втДолжности.Период) КАК Период
							 |ПОМЕСТИТЬ втДолжностиПериоды
							 |ИЗ
							 |	втДолжности КАК втДолжности
							 |СГРУППИРОВАТЬ ПО
							 |	втДолжности.Сотрудник
							 |
							 |ИНДЕКСИРОВАТЬ ПО
							 |	Сотрудник,
							 |	Период
							 |;
							 |
							 |////////////////////////////////////////////////////////////////////////////////
							 |ВЫБРАТЬ
							 |	втДолжности.Сотрудник КАК Сотрудник,
							 |	МИНИМУМ(втДолжности.Организация) КАК Организация,
							 |	МИНИМУМ(втДолжности.Подразделение) КАК Подразделение,
							 |	МИНИМУМ(втДолжности.Должность) КАК Должность,
							 |	МИНИМУМ(втДолжности.ТипДоговора) КАК ТипДоговора
							 |ПОМЕСТИТЬ втДолжностиСотрудников
							 |ИЗ
							 |	втДолжности КАК втДолжности
							 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДолжностиПериоды КАК втДолжностиПериоды
							 |		ПО втДолжности.Сотрудник = втДолжностиПериоды.Сотрудник
							 |		И (втДолжностиПериоды.Период = втДолжности.Период)
							 |СГРУППИРОВАТЬ ПО
							 |	втДолжности.Сотрудник
							 |
							 |ИНДЕКСИРОВАТЬ ПО
							 |	Сотрудник
							 |;
							 |
							 |////////////////////////////////////////////////////////////////////////////////
							 |ВЫБРАТЬ
							 |	МАКСИМУМ(КадровыйПриказ.Должность) КАК Должность,
							 |	МАКСИМУМ(КадровыйПриказ.Отдел) КАК Отдел,
							 |	КадровыйПриказ.Сотрудник КАК Сотрудник,
							 |	МАКСИМУМ(КадровыйПриказ.Дата) КАК ДатаДоговора
							 |ПОМЕСТИТЬ ВТ_ДолжностиНовые
							 |ИЗ
							 |	Документ.КадровыйПриказ КАК КадровыйПриказ
							 |СГРУППИРОВАТЬ ПО
							 |	КадровыйПриказ.Сотрудник
							 |;
							 |
							 |////////////////////////////////////////////////////////////////////////////////
							 |ВЫБРАТЬ
							 |	СотрудникиКонтактнаяИнформация.Ссылка КАК Ссылка,
							 |	СотрудникиКонтактнаяИнформация.Представление КАК Представление,
							 |	СотрудникиКонтактнаяИнформация.Представление КАК ТелефонЛичный
							 |ПОМЕСТИТЬ ТелефоныЛичные
							 |ИЗ
							 |	Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
							 |ГДЕ
							 |	СотрудникиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСотрудникаЛичный)
							 |;
							 |
							 |////////////////////////////////////////////////////////////////////////////////
							 |ВЫБРАТЬ
							 |	СотрудникиКонтактнаяИнформация.Ссылка КАК Ссылка,
							 |	СотрудникиКонтактнаяИнформация.Представление КАК Представление,
							 |	СотрудникиКонтактнаяИнформация.Представление КАК ТелефонСлужебный
							 |ПОМЕСТИТЬ ТелефоныСлужебные
							 |ИЗ
							 |	Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
							 |ГДЕ
							 |	СотрудникиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСотрудникаСлужебный)
							 |;
							 |
							 |////////////////////////////////////////////////////////////////////////////////
							 |ВЫБРАТЬ
							 |	ТелефоныЛичные.ТелефонЛичный КАК ТелефонЛичный,
							 |	ТелефоныСлужебные.ТелефонСлужебный КАК ТелефонСлужебный,
							 |	Сотрудники.Наименование КАК Наименование,
							 |	Сотрудники.Код КАК Код,
							 |	втДолжностиСотрудников.Организация КАК Организация,
							 |	втДолжностиСотрудников.Подразделение КАК Подразделение,
							 |	втДолжностиСотрудников.Должность КАК Должность,
							 |	Сотрудники.ДатаРождения КАК ДатаРождения,
							 |	ЕСТЬNULL(втДолжностиСотрудников.Должность,
							 |		ЗНАЧЕНИЕ(Справочник.ДолжностиПредприятия.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ДолжностиПредприятия.ПустаяСсылка) КАК
							 |		Действующий,
							 |	Сотрудники.Руководитель КАК Руководитель,
							 |	Сотрудники.МестоРаботы КАК МестоРаботы,
							 |	Сотрудники.ПарольДляУК КАК ПарольДляУК,
							 |	Сотрудники.Тележка КАК Тележка,
							 |	Сотрудники.РолиWT10.(
							 |		Ссылка,
							 |		НомерСтроки,
							 |		Роль)
							 |ИЗ
							 |	Справочник.Сотрудники КАК Сотрудники
							 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДолжностиНовые КАК ВТ_ДолжностиНовые
							 |		ПО (ВТ_ДолжностиНовые.Сотрудник = Сотрудники.Ссылка)
							 |		ЛЕВОЕ СОЕДИНЕНИЕ втДолжностиСотрудников КАК втДолжностиСотрудников
							 |		ПО (втДолжностиСотрудников.Сотрудник = Сотрудники.Ссылка)
							 |		ЛЕВОЕ СОЕДИНЕНИЕ ТелефоныЛичные КАК ТелефоныЛичные
							 |		ПО (ТелефоныЛичные.Ссылка = Сотрудники.Ссылка)
							 |		ЛЕВОЕ СОЕДИНЕНИЕ ТелефоныСлужебные КАК ТелефоныСлужебные
							 |		ПО (ТелефоныСлужебные.Ссылка = Сотрудники.Ссылка)
							 |ГДЕ
							 |	НЕ Сотрудники.Пользователь.Недействителен
							 | И (ТелефоныЛичные.ТелефонЛичный = &Телефон
							 |	ИЛИ ТелефоныСлужебные.ТелефонСлужебный = &Телефон)";

	Тело = Запрос.ПолучитьТелоКакстроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Тело);

	Массив = ПрочитатьJSON(ЧтениеJSON);

	ЗапросСотрудника.УстановитьПараметр("Телефон", Строка(Массив.phone));
	ВыборкаСотрудника = ЗапросСотрудника.Выполнить().Выбрать();
	Если ВыборкаСотрудника.Количество() > 0 Тогда
		ВыборкаСотрудника.Следующий();
		СтруктураОтвета = Новый Структура;
		СтруктураОтвета.Вставить("name", Строка(ВыборкаСотрудника.Наименование));
		СтруктураОтвета.Вставить("id", Строка(ВыборкаСотрудника.Код));
		СтруктураОтвета.Вставить("company", Строка(ВыборкаСотрудника.Организация));
		СтруктураОтвета.Вставить("post", Строка(ВыборкаСотрудника.Должность));
		СтруктураОтвета.Вставить("birthdate", Строка(ВыборкаСотрудника.ДатаРождения));
		СтруктураОтвета.Вставить("pphone", Строка(ВыборкаСотрудника.ТелефонЛичный));
		СтруктураОтвета.Вставить("wphone", Строка(ВыборкаСотрудника.ТелефонСлужебный));
		СтруктураОтвета.Вставить("car", Строка(ВыборкаСотрудника.Тележка));
		Если ВыборкаСотрудника.Тележка <> Справочники.Стеллаж.ПустаяСсылка() Тогда
			СтруктураОтвета.Вставить("car_items", КоличествоТоваровВКорзине(ВыборкаСотрудника.Тележка));
		Иначе
			СтруктураОтвета.Вставить("car_items", 0);
		КонецЕсли;

		Роли = ВыборкаСотрудника.РолиWT10.Выгрузить();

		МассивРолей = Новый массив;
		Для Каждого стр Из Роли Цикл
			Структурароли = Новый Структура;
			Структурароли.Вставить("id", Стр.Роль.Код);
			Структурароли.Вставить("title", Строка(Стр.Роль));
			МассивРолей.Добавить(Строка(Стр.Роль));
		КонецЦикла;

		СтруктураОтвета.Вставить("roles", Структурароли);

		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();

		ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();

		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");

		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

		Возврат Ответ;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьАвторизациюКлиентаAuthorizationclient(Запрос)
	
	Тело = Запрос.ПолучитьТелоКакстроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Тело);

	Массив = ПрочитатьJSON(ЧтениеJSON);
	Телефон= СокрЛП(Массив.phone);
	МассивСтрок = Новый Массив;
	Для Сч = 1 По СтрДлина(Телефон) Цикл
		МассивСтрок.Добавить(Сред(Телефон, Сч, 1));
	КонецЦикла;
	МассивСтрок[2] = " " + МассивСтрок[2];
	МассивСтрок[5] = " " + МассивСтрок[5];
	МассивСтрок[8] = "-" + МассивСтрок[8];
	МассивСтрок[10] = "-" + МассивСтрок[10];
	Телефон = СтрСоединить(МассивСтрок, "");

	ЗапросКлиента = Новый запрос;
	ЗапросКлиента.Текст = "ВЫБРАТЬ
						  |	Клиенты.Код КАК Код,
						  |	Клиенты.Наименование КАК Наименование,
						  |	Клиенты.Телефон
						  |ИЗ
						  |	Справочник.Клиенты КАК Клиенты
						  |ГДЕ
						  |	(Клиенты.Телефон = &Телефон
						  |	ИЛИ Клиенты.Телефон = &ТелефонБезМаски)";

	ЗапросКлиента.УстановитьПараметр("Телефон", Телефон);
	ЗапросКлиента.УстановитьПараметр("ТелефонБезМаски", Массив.phone);
	ВыборкаКлиента = ЗапросКлиента.Выполнить().Выбрать();
	Если ВыборкаКлиента.Количество() > 0 Тогда
		ВыборкаКлиента.Следующий();
		СтруктураОтвета = Новый Структура;
		СтруктураОтвета.Вставить("name", Строка(ВыборкаКлиента.Наименование));
		СтруктураОтвета.Вставить("id", Строка(ВыборкаКлиента.Код));
		СтруктураОтвета.Вставить("wphone", Строка(ВыборкаКлиента.Телефон));

		МассивРолей = Новый массив;

		МассивРолей.Добавить("Клиент");
		Структурароли = Новый Структура;
		Структурароли.Вставить("id", "000000099");
		Структурароли.Вставить("title", "Клиент");
		МассивРолей.Добавить(Структурароли);
		СтруктураОтвета.Вставить("roles", Структурароли);
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();

		ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();

		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");

		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

		Возврат Ответ;
	Иначе
		НовыйКлиент = Справочники.Клиенты.СоздатьЭлемент();
		НовыйКлиент.Наименование = Массив.client_name;
		НовыйКлиент.Телефон = Телефон;
		НовыйКлиент.Записать();

		ВыборкаКлиента.Следующий();
		СтруктураОтвета = Новый Структура;
		СтруктураОтвета.Вставить("name", Строка(НовыйКлиент.Наименование));
		СтруктураОтвета.Вставить("id", Строка(НовыйКлиент.Код));
		СтруктураОтвета.Вставить("wphone", Строка(НовыйКлиент.Телефон));
		МассивРолей = Новый массив;

		МассивРолей.Добавить("Клиент");
		Структурароли = Новый Структура;
		Структурароли.Вставить("id", "000000099");
		Структурароли.Вставить("title", "Клиент");
		МассивРолей.Добавить(Структурароли);
		СтруктураОтвета.Вставить("roles", Структурароли);
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();

		ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();

		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");

		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

		Возврат Ответ;
	КонецЕсли;
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция КоличествоТоваровВКорзине(Тележка)
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИндНомер.индкод) КАК Количество,
				   |	ИндНомер.Стеллаж КАК Стеллаж
				   |ИЗ
				   |	РегистрСведений.ИндНомер КАК ИндНомер
				   |ГДЕ
				   |	ИндНомер.Стеллаж = &Стеллаж
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	ИндНомер.Стеллаж";
	Запрос.УстановитьПараметр("Стеллаж", Тележка);
	Выборка = запрос.Выполнить().Выбрать();

	Если выборка.Количество() > 0 Тогда
		Выборка.Следующий();
		Возврат выборка.Количество;
	Иначе
		Возврат 0;
	КонецЕсли;

КонецФункции

#КонецОбласти
